function History() {
    return (
      <section className="history-values">
        <h2>Наша історія й цінності</h2>
        <p>
          Ми в Селесті віримо, що їжа — це більше, ніж просто їжа — це досвід. Заснована в 2010 році,
          Селеста починалася як невелике бістро з пристрастю додавати свіжі місцеві інгредієнти на кожну тарілку.
          За ці роки ми перетворилися на улюблений заклад у центрі Единбурга, поєднуючи класичні техніки з сучасними смаками.
        </p>
        <p>
          <br />
          Наші цінності ґрунтуються на стійкості, креативності та гостинності. Ми прагнемо надати не тільки виняткову їжу,
          але й привабливу атмосферу, де кожен гість почуватиметься частиною сім’ї Селести.
        </p>
      </section>
    );
  }
  
  export default History;